# Description:
#   イカbot
#

stageTalk = {
    'Bバスパーク': [
        ':aori: スケボーは苦手...骨折とかしそう...\n:hotaru: 骨、無いじゃん...\n'
        ':aori: ここは接近戦が勝負の決め手！死角も多い！\n:hotaru: 高台からチャージャー使うのも捨てがたいよね〜\n'
        ':aori: ホタルちゃん！ここで気を付ける所は？\n:hotaru: ......背後？\n'
    ],
    'デカライン高架下': [
        ':aori: ドライブに連れてってくれるイケメン君！れんらく、ヨロシクー！\n:hotaru: 公共の電波は正しく使いましょ〜\n'
        ':aori: いつ見てもデカい道だよねー！\n:hotaru: そこはバトル、関係ないっしょ\n'
        ':aori: ねぇねぇホタルちゃん、ここの必勝法教えてー！\n:hotaru: え〜、言えるワケないじゃん\n'
    ],
    'シオノメ油田': [
        ':aori: ここのエレベーター、乗るの楽しいよね！ワクワク♪\n:hotaru: え？こわくね？\n'
        ':aori: バトル後に出てくるジャッジくんって、バトル中はどこで待ってるんだろ？\n:hotaru: 魚食べてるの、見かけた事あるけどな〜\n'
        ':aori: ここは高い所を制すと有利！...とも限らないのがポイント！\n:hotaru: 低い所ばっかでもダメ〜\n'
    ],
    'ハコフグ倉庫': [
        ':aori: 荷物に乗って、高いとこからショーーット！\n:hotaru: ......ん？一番好きなのはローラーなんじゃん？\n'
        ':aori: ここ、いつもコンテナだらけだよね　何が入ってんだろ？\n:hotaru: アタシたちのグッズだったらな〜\n'
        ':aori: 暗い工場の片スミで若い2人が...\n:hotaru: バトルに明け暮れま〜す♪\n'
    ],
    'アロワナモール': [
        ':aori: ここでのバトルだけど、ホタルちゃんならどう決める？\n:hotaru: マンタのようにまい、メカジキのようにさす！\n'
        ':aori: ここのフードコートのポテト、おいしいから食べ過ぎちゃう！\n:hotaru: あの量見るたびに、ドン引きするわ...\n'
        ':aori: ここ、よく営業に来るんだよねー！\n:hotaru: ...アオリちゃん、ピンでやってる？\n'
    ],
    'ホッケふ頭': [
        ':aori: ここは見通しがいいから、チャージャーがかつやくするかも？\n:hotaru: ...と見せかけて、ローラーかもね\n'
        ':aori: ここ、バトルが無い時はオススメのデートスポットらしいよ\n:hotaru: え〜？それは無いわ〜\n'
        ':aori: フトウかー！つぶつぶ、あまくておいしいよねー！\n:hotaru: アオリちゃん...それブドウじゃね...？\n'
    ],
    'モズク農園': [
        ':aori: ここっていつもポカポカしてるよね！\n:hotaru: 暑いのヤダ〜\n'
        ':aori: ハイカラシティのハイテク農園！いやー、すごい時代になったもんだ！\n:hotaru: アオリちゃん、アンタ何才ね...？\n'
        ':aori: そう言えば、じーちゃんが子供の時トマトとか無かったらしいよ！\n:hotaru: その時代に生まれたかった...\n'
    ],
    'ネギトロ炭鉱': [
        ':aori: ここ、昔は人がいっぱい居たんだよね\n:hotaru: おじいちゃんの世代の人らはここでよくバトルしてたらしいよ〜\n'
        ':aori: 昔、この近くに駅があったらしいよ\n:hotaru: へ〜\n'
        ':aori: ここは夜すごいまぶしい船が走ってるけど、何してんのかな？\n:hotaru: アレ見ると付いて行きたくなるよね〜\n'
    ],
    'タチウオパーキング': [
        ':aori: ちょっとした足場も上手く使おー！\n:hotaru: アオリちゃんがまともな事言ってる...\n'
        ':aori: ここ、ローラーで一気にかけ下りるとチョー気持ちいいー！\n:hotaru: そこをチャージャーでパスッ！\n'
        ':aori: それにしても、ここ高いよねー...\n:hotaru: がけっぷちでバトるのがアツいんじゃん？\n'
    ],
    'モンガラキャンプ場': [
        ':aori: しっかし、ここのトーテムポール、いつ見てもキモイ...\n:hotaru: え...アタシはカワイイと思うけど...\n'
        ':aori: ここは広いぞー！走れ走れー！\n:hotaru: アタシなら、あえて動かずチャージャーかな〜\n'
        ':aori: ここの水には落ちないようにしなきゃね\n:hotaru: アタシたち、泳げんからね...\n'
    ],
    'ヒラメが丘団地': [
        ':aori: ここ、高いところから見える夕日がキレイなんだよねー！\n:hotaru: さえぎるもん無いから、西日キッツいわ〜\n'
        ':aori: 昔みたいにここで鬼ごっこしたいなー！\n:hotaru: アオリちゃん、うるさくしてすぐ怒られてたじゃん...\n'
        ':aori: ジャッジくんがここからハイカラシティに向かってるとこ見たよ！\n:hotaru: この辺に住んでんのかな？\n'
    ],
    'マザバ海峡大橋': [
        ':aori: ここ開通したらスタジオ近くなるのになー　そしたらもっと働ける！\n:hotaru: それ、もっと寝てたいだけだよね...\n'
        ':aori: ここから遠くに見える島とかでノンビリおひるねとかしたいなー\n:hotaru: いつもじゅうぶん居眠りしてんじゃん...\n'
        ':aori: ハイ、ホタルちゃん！ここの攻略ポイントを一言でよろしくー！\n:hotaru: アミの下からショットをうとう！とかじゃん？\n'
    ],
    'キンメダイ美術館': [
        ':aori: バトルの終わり際に、味方全員にバリアおすそ分けするの、何て命名したっけ？\n:hotaru: エターナルファランクスΩな\n'
        ':aori: アタシ、絵見るの好きなんだー！\n:hotaru: 見ながら寝てたじゃん...\n'
        ':aori: ここでおにごっこしたら楽しそうー！\n:hotaru: 美術館では静かにしよ〜\n'
    ],
    'マヒマヒリゾート&スパ': [
        ':aori: ホタルちゃん命名の、バトルの最後にトルネードするの何って言うんだっけ？\n:hotaru: ファイナルクリスタルダストな\n'
        ':aori: ここでのバトルって、昼間は太陽がアツいよねー\n:hotaru: お客さんの視線もアツいけどな\n'
        ':aori: 水に落ちた後のジャッジ君、ズブぬれだと誰かわかんなかったよ\n:hotaru: 中に人は入ってなかったか\n'
    ],
    'ショッツル鉱山': [
        ':aori: なつかしー！ここもバイトやってたなー\n:hotaru: アオリちゃんの肉体労働って絵になるわ〜\n'
        ':aori: あのデッカイ機械の名前知ってるー！なんとかベーター！！\n:hotaru: 知ってないやん\n'
        ':aori: ここって、宝石とか取れるのかな？\n:hotaru: 取れたらバトルとかしてないっしょ\n'
    ],
    'アンチョビットゲームズ': [
        ':aori: あ、ミーティング！ミーティング行かなきゃだわー\n:hotaru: ウチらにそんなのあったっけ？\n'
        ':aori: ここで働いてる人って賢そうだよねー！\n:hotaru: 人によるっしょ\n'
        ':aori: ここの社員食堂って、タダで食べ放題なんだって！\n:hotaru: ま〜たポテトの事、考えとったっしょ\n'
    ],
}

module.exports = (robot) ->
    robot.hear /(ハイカラニュース)/i, (msg) ->
        resText =  ':aori: ごきげんイカがですか？ハイカラニュースの時間だよ！\n'
        resText += ':hotaru: こんちゃ〜、シオカラーズで〜す。\n'
        resText += ' \n'
        msg.send resText

        req_nawabari = msg.http('http://splapi.retrorocket.biz/regular/now').get()
        req_nawabari (err, res, body) ->
            json_nawabari = (JSON.parse body)['result'][0]
            resText =  ':aori: 現在のレギュラーマッチのステージはコチラ！\n'
            resText += ':hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n'
            resText += ' \n'
            msg.send resText
            for m in json_nawabari['maps']
                resText =  '【' + m + '】\n'
                resText += msg.random stageTalk[m]
                resText += ' \n'
                msg.send resText

            req_gachi = msg.http('http://splapi.retrorocket.biz/gachi/now').get()
            req_gachi (err, res, body) ->
                json_gachi= (JSON.parse body)['result'][0]
                resText =  ':aori: 現在のガチマッチのステージはコチラ！\n'
                resText += ':hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n'
                resText += ' \n'
                msg.send resText
                for m in json_gachi['maps']
                    resText =  '【' + m + '】\n'
                    resText += msg.random stageTalk[m]
                    resText += ' \n'
                    msg.send resText

                resText =  ':aori: じゃ、今日も元気にいってみよー！\n'
                resText +=  ':aori: イカよろしくーーー！\n'
                resText += ':hotaru: イカよろしく〜〜〜\n'
                resText += ' \n'
                msg.send resText

